//ЗАДАНИЕ 4

// Создаем первую переменную 'num1' и задаем ей значение 10
let num1 = 10;

// Создаем вторую переменную 'num2' и задаем ей значение 2
let num2 = 2;

// Вычисляем сумму двух чисел и выводим на экран
alert("Сумма: " + (num1 + num2));

// Вычисляем разность двух чисел и выводим на экран
alert("Разность: " + (num1 - num2));

// Вычисляем произведение двух чисел и выводим на экран
alert("Произведение: " + (num1 * num2));

// Вычисляем деление числа num1 на num2 и выводим на экран
alert("Частное: " + (num1 / num2));


